app/controllers/comments_controller.rb

  def show
    @user = current_user
    @comment = Comment.find(params[:id]) # Finding my comment id
    @show_user = @comment[:user_email]
    @post = Post.find(params[:post_id]) # Finding my post id
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def new ## this needs to render the post id (from the route) and that a comment is going to be new
    @user = current_user
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 5]]

  def create
    @post = Post.find(params[:post_id]) # Finding the post id
    @comment = @post.comments.create!(comment_params)
    @comment.user = current_user # Set the user who posts the comment
    @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("subject", "comment", "user_email", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["subject", "Leaving"], ["comment", "A comment"], ["user_email", "andersenek@gmail.com"], ["post_id", 5], ["created_at", "2015-08-06 19:22:45.658154"], ["updated_at", "2015-08-06 19:22:45.658154"]]
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["user_id", 1], ["updated_at", "2015-08-06 18:32:47.679638"], ["id", 3]]

  def edit ### this is going to need the post id and the comment id, (the form should be pre filled in)
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @post = Post.find(params[:post_id])
    @user = current_user
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "comments" SET "subject" = $1, "user_email" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["subject", "This leather jacket is awesome edit"], ["user_email", "andersenek@gmail.com"], ["updated_at", "2015-08-06 23:51:54.988386"], ["id", 6]]

  def destroy
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]