app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%'%Jeans%'%')  ORDER BY created_at DESC

  def show
    @user = current_user
    @post = Post.find(params[:id]) # Finding the post id
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @post = Post.create!(post_params)
    @post.user = current_user
    @post.save
---
INSERT INTO "posts" ("title", "brand_name", "retailer", "price", "size", "description", "photo_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "posts" SET "user_id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["user_id", 1], ["updated_at", "2015-08-04 14:29:21.960253"], ["id", 4]]

  def update
    @post = Post.find(params[:id])

    if @post.user_id == current_user.id # A post can only be edited by user who created the post
      @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "posts" SET "retailer" = $1, "price" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["retailer", "this"], ["price", "post"], ["updated_at", "2015-08-06 15:20:59.882584"], ["id", 11]]

  def destroy
    @post = Post.find(params[:id])

    if @post.user_id == current_user.id # A post can only be deleted by user who created the post
      @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]

  def favorite
    type = params[:type] # See posts/show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]